# Запит ім'я користувача
name = input("Введіть ваше ім'я: ")

# Запит електронної пошти користувача
email = input("Введіть вашу електронну пошту: ")

# Запит віку користувача та перетворення в int
age = int(input("Введіть ваш вік: "))

# Запит зросту користувача та перетворення в float
height = float(input("Введіть ваш зріст у метрах: "))

# Запит бажання користувача отримувати повідомлення від сайту та перетворення в bool
is_active_input = input("Бажаєте отримувати повідомлення від сайту? (Так/Ні): ")
is_active = is_active_input.lower() == 'так'

# Виведення введених даних для перевірки
print("Ім'я:", name)
print("Електронна пошта:", email)
print("Вік:", age)
print("Зріст:", height)
print("Бажаєте отримувати повідомлення від сайту?", is_active)
