'''
Кортежі в Python — це важлива структура даних,
подібна до списків, але з ключовою відмінністю:
вони незмінні. Це означає, що після створення кортежу,
не можна змінити його елементи, не можна додавати/видаляти/
переставляти елементи. При спробі змінити кортеж, ви отримаєте
повідомлення про помилку.
'''
my_tuple = (1, 2, 3)

'''
Якщо ви хочете створити кортеж з одним елементом, не забудьте
поставити кому. Це важливо, запам'ятай це! Інакше ви отримаєте
змінну, яка просто зберігає елемент кортежу.

Річ у тому, що Python використовує круглі дужки як математичні
символи. Якщо написати вираз на кшталт my_tuple = (1),
виникає невизначеність.
'''
my_tuple = (1,)

'''
Кортеж можна створити без дужок, ця операція називається упакування кортежу:
'''
my_tuple = 1, "Hello", 3.14


'''
Наприклад, розглянемо набір точок на площині (кортежі).
Їх можна використовувати як ключі у словнику:
'''
points = {
    (0, 0): "O",
    (1, 1): "A",
    (2, 2): "B"
}
'''
У словнику points використовуються кортежі з координатами точок
як ключі, а значення — це імена (назва) точок.

Головна різниця між кортежами та списками полягає в їхній незмінності.
Кортежі — це чудовий вибір, коли тобі потрібна впорядкована колекція,
яка не повинна змінюватися. Списки ж ідеально підходять для випадків,
коли тобі потрібна подібна до кортежу структура, але з можливістю модифікації.
'''