from pathlib import Path

path = Path("./Работа с файлами")

# Перевірка існування
if path.exists():
    print(f"{path} існує")

# Перевірка, чи це директорія
if path.is_dir():
    print(f"{path} є директорією")

# Перевірка, чи це файл
if path.is_file():
    print(f"{path} є файлом")


'''
Модуль pathlib також надає декілька методів для перевірки існування та типу файлових об'єктів:

метод exists() перевіряє, чи існує файл або директорія.
метод is_dir() перевіряє, чи є об'єкт директорією.
метод is_file() перевіряє, чи є об'єкт файлом.
'''