'''
Основные типы исключений в Python:
1 - SyntaxError – синтаксическая ошибка.
2 - IndentationError — ошибка, возникающая, если в выделении блоков инструкций пробелами допущена ошибка.
3 - TabError возникает, если в одном файле использовать пробелы и табуляции для выделения блоков инструкций.
4 - TypeError возникает, когда операция с переменной этого типа невозможна.
5 - ValueError возникает, когда тип операнда соответствующий, но значение такое, что операцию невозможно выполнить.
6 - ZeroDivisionError - деление на ноль.
'''